// src/data/suppliers.js
export const suppliersData = {
  '古場': [
    'ハラミ', 'サガリ', 'セセリ', 'ヤゲン', '牛脂', 'ミンチ', '豚バラブロック'
  ],
  '北山': [
    'らんおう', 'ミスジ', 'Pタン', 'ユッケスライス', '牛タン', 'インサイドスカート', 
    'ウインナー', '雲仙ハム', 'スレートフィンガー（中落ち）', 'コブ（特上カルビor特上ロース）'
  ],
  'わらいば': [
    '赤身'
  ],
  'マツダ': [
    'レバー', 'ミノ', 'テッチャン', 'ギアラ', 'センマイ'
  ],
  'コストコ': [
    'ラム', 'タン先', 'カキ', 'ホタテ', 'マスタード', 'クリームチーズ', 'マヨネーズ', '味の素'
  ],
  '業スー': [
    'ネギ', '長芋', 'トマト', 'MIXチーズ', 'ファミリア', 'ガリ', '安卵', '冷凍エビ',
    'バター', 'みそ', 'ケチャップ', 'なし缶', 'サラダ油', 'ごま油', '濃口醤油',
    'みりん', '上白糖', '中双糖', '塩昆布', 'かつおぶし', 'さんじゃんミソ', 
    'おろしニンニク', 'おろししょうが', 'ブラックペッパー', 'ミツカン酢', 'ガス缶', 
    'わりばし', 'ラップ', 'ウェットティッシュ', 'アルコールスプレー', 'すりごま', 
    'いりごま', 'スポンジ', 'たくあん', '冷凍アサリ'
  ],
  '岩田': [
    'チーズケーキ', 'だしだ', 'わさび', '料理酒', 'ほんだし', '柚子胡椒'
  ],
  'ワールド': [
    'ムネ', 'ズリ', 'キモ'
  ],
  'つるが': [
    'きぬ豆腐', '厚揚げ'
  ],
  '青山': [
    'キムチ', 'チャンジャ', 'ポッサム豚', '青唐辛子', '中辛'
  ],
  '黄金': [
    'ピーマン', '赤ナス'
  ],
  'Aプラ': [
    'ポテト', 'ゲソから', '梅水晶'
  ],
  '田中青果': [
    'レモン', 'ズッキーニ', 'しいたけ', 'かんきつ'
  ],
  'イオン': [
    'やまに醤油', 'パセリ', 'かいわれ', '赤ウインナー', 'サニー', '（赤ナス）', 
    'きゅうり', 'アルファルファ', 'ししゃも', '豆もやし', '換気扇フィルター', 
    'ハイター', 'トイレットペーパー', 'チンご飯', '韓国海苔', 'かまぼこ', 
    '洗剤詰め替え', 'マジックリン詰め替え', '食器洗剤', 'エアコンフィルター', 
    '安豆腐', '納豆', '一味つめかえ', 'ニラ'
  ]
};